Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: When the name of a property or method is not known in advance, it can (and must) be accessed by using percent signs.
ja: プロパティやメソッドの名前が事前にわからない場合、パーセント記号を使ってアクセスすることができる（しなければならない）。

source: When the operation is completed, the script restores the original clipboard contents as shown in example #1 and example #2.
ja: 操作が完了すると、スクリプトは例1および例2に示すように、元のクリップボードの内容を復元します。

source: When the phrase "row number" is used on this page, it refers to a row's current position within the ListView.
ja: 本ページで「行番号」と表記しているのは、ListView内の行の現在位置のことです。

source: When the script encounters these two lines, it will display the current contents of all variables for your inspection.
ja: スクリプトがこの2行に出会うと、すべての変数の現在の内容が表示され、閲覧できるようになる。

source: When the script exits, objects contained by global and static variables are released automatically in an arbitrary, implementation-defined order.
ja: スクリプトが終了すると、グローバル変数と静的変数に含まれるオブジェクトは、実装で定義された任意の順序で自動的に解放されます。

source: When the script is reloaded, this switch is automatically passed to the new instance.
ja: スクリプトがリロードされると、このスイッチは自動的に新しいインスタンスに渡される。

source: When the script is compiled, unless /script is used.
ja: /scriptが使われていない場合に限り、スクリプトをコンパイルするとき。

source: When the script is displaying a system dialog such as MsgBox, any message posted to a control is not monitored.
ja: スクリプトがMsgBoxなどのシステムダイアログを表示している場合、コントロールに投稿されたメッセージは監視されません。

source: When the script is loaded, this constructs a Class object and stores it in a global constant (read-only variable) with the name ClassName.
ja: スクリプトがロードされると、Classオブジェクトが構築され、ClassNameという名前のグローバル定数（読み取り専用変数）に格納されます。

source: When the script is terminated, all loaded files are unloaded automatically.
ja: スクリプトの終了時には、ロードされたすべてのファイルが自動的にアンロードされます。

source: When the script queries a key which is not found, the map checks for this property before throwing an UnsetItemError.
ja: スクリプトが見つからないキーを照会するとき、マップはUnsetItemErrorを投げる前にこのプロパティをチェックします。

source: When the script requests an element which has no value, the array checks for this property before throwing an UnsetItemError.
ja: スクリプトが値のない要素を要求したとき、配列はUnsetItemErrorを投げる前にこのプロパティをチェックします。

source: When the script restarts, it is launched in its original working directory (the one that was in effect when it was first launched).
ja: スクリプトが再起動すると、元の作業ディレクトリ（最初に起動したときに有効だったもの）で起動します。

source: When the source is a custom combination, the wildcard modifier (*) is omitted to allow the hotkeys to work.
ja: ソースがカスタムの組み合わせである場合、ワイルドカード修飾子（*）はホットキーが機能するように省略されます。

source: When the source key is the left Ctrl and the destination key is Alt, the line Send "{Blind}{LAlt DownR}" is replaced by Send "{Blind}{LCtrl up}{LAlt DownR}".
ja: 送信元キーが左Ctrl、送信先キーがAltの場合、Send "{Blind}{LAlt DownR}"という行は、Send "{Blind}{LCtrl up}{LAlt DownR}"に置き換えられる。

source: When the source of the main script is an embedded resource, the program acts in "compiled script" mode, with the exception that A_AhkPath always contains the path of the current executable file (the same as A_ScriptFullPath).
ja: メイン・スクリプトのソースが埋め込みリソースである場合、プログラムは「コンパイル済みスクリプト」モードで動作するが、例外としてA_AhkPathには常に現在の実行可能ファイルのパスが含まれる（A_ScriptFullPathと同じ）。

source: When the text reaches this length, the Input is terminated and EndReason is set to the word Max (unless the text matches one of the MatchList phrases, in which case EndReason is set to the word Match).
ja: テキストがこの長さに達すると、入力は終了し、EndReasonにはMaxという単語が設定されます（ただし、テキストがMatchListのフレーズのいずれかに一致する場合は、EndReasonにはMatchという単語が設定されます）。

source: When the user changes the state by using the space bar, all selected items cycle over, not the item with the focus.
ja: ユーザーがスペースバーを使って状態を変更すると、フォーカスのあるアイテムではなく、選択されているすべてのアイテムがサイクルオーバーする。

source: When the user closes the window or it is hidden by Hide, Show or Submit, this extra reference is released.
ja: ユーザーがウィンドウを閉じたり、Hide、Show、Submitでウィンドウが隠されたりすると、この余分な参照は解放されます。

source: When the user double-clicks the tray icon, its default menu item is launched (even if the item is disabled).
ja: ユーザーがトレイアイコンをダブルクリックすると、そのデフォルトのメニュー項目が起動します（その項目が無効になっている場合でも）。

source: When the user presses Enter, the control scrolls all text back to the zero position.
ja: ユーザーがEnterを押すと、コントロールはすべてのテキストをゼロ位置にスクロールして戻す。

source: When the user selects a folder, its contents are shown in a ListView to the right (like Windows Explorer).
ja: ユーザーがフォルダを選択すると、その内容が（Windowsエクスプローラのように）右側のリストビューに表示されます。

source: When the window is resized (even by the script), the Size event might not be raised immediately.
ja: ウィンドウのサイズが変更された場合（スクリプトでも）、Sizeイベントがすぐに発生しない場合があります。

source: When the window is shown for the first time, the first input-capable control that has the Tabstop style (which most control types have by default) will have keyboard focus, unless that control is a Button and there is a Default button, in which case the latter is focused instead.
ja: ただし、そのコントロールがボタンであり、かつデフォルトのボタンがある場合は、後者が代わりにフォーカスされます。

source: When this function is used to wrap an IDispatch or IUnknown interface pointer (passed as an integer), the wrapper object assumes responsibility for automatically releasing the pointer when appropriate.
ja: この関数がIDispatchまたはIUnknownインターフェイスポインタ（整数として渡される）をラップするために使用される場合、ラッパーオブジェクトは、適切なときにポインタを自動的に解放する責任を負うものとします。

source: When this happens, the remaining keystrokes are not sent but the script continues executing as though the SendPlay had completed normally.
ja: この場合、残りのキー入力は送信されませんが、SendPlayが正常に完了したかのようにスクリプトの実行は継続されます。

source: When this parameter is "Col" or "Column", it returns the number of columns in the control.
ja: このパラメータが "Col"または "Column"の場合、コントロールのカラム数を返します。

source: When this parameter is "S" or "Selected", the count includes only the selected/highlighted rows.
ja: このパラメータが "S"または "Selected"の場合、カウントは選択/ハイライトされた行のみを含みます。

source: When this parameter is omitted, it returns the total number of rows in the control.
ja: 本パラメータが省略された場合は、コントロールの総行数を返します。

source: When this style is present, the control automatically reverts to the Classic Theme appearance.
ja: このスタイルが存在すると、コントロールは自動的にクラシック・テーマの外観に戻る。

source: When used inside a function, ListVars displays a function's local variables along with their contents.
ja: 関数内で使用すると、ListVarsは関数のローカル変数をその内容とともに表示します。

source: When used inside a registry loop, the following functions can be used in a simplified way to indicate that the currently retrieved item should be operated upon:
ja: レジストリループ内で使用する場合、以下の関数を簡略化して使用することで、現在検索されている項目が操作されるべきことを示すことができます：

source: When used inside a registry-loop, the following functions can be used in a simplified way to indicate that the currently retrieved item should be operated upon:
ja: レジストリループ内で使用する場合、以下の関数を簡略化して使用することで、現在検索されている項目が操作されるべきことを示すことができます：

source: When used inside another function, Expression can refer to the outer function's variables (this can also be done with a normal function definition).
ja: 他の関数の内部で使用する場合、Expressionは、外部関数の変数を参照することができます（これは通常の関数定義でも可能です）。

source: When used with Opt, this option enables or disables redraw (visual updates) for a control by sending it a WM_SETREDRAW message.
ja: Optと併用することで、WM_SETREDRAWメッセージを送信してコントロールの再描画（ビジュアルアップデート）を有効または無効にすることができます。

source: When used with a compiled script based on an .exe file, this switch causes the program to ignore the main embedded script.
ja: .exeファイルに基づいてコンパイルされたスクリプトで使用する場合、このスイッチは、プログラムがメインの埋め込みスクリプトを無視するようにします。

source: When used with option N (numeric sort), the string's character position is used, which is not necessarily the same as the number's digit position.
ja: オプションN（数値ソート）と併用する場合、文字列の文字位置が使われるが、これは必ずしも数値の桁位置と同じではない。

source: When using a 32-bit version of AutoHotkey, or if the target window is 32-bit, the result is a 32-bit unsigned integer between 0 and 4294967295.
ja: 32ビット版のAutoHotkeyを使用している場合、またはターゲットウィンドウが32ビットの場合、結果は0～4294967295の32ビット符号なし整数になります。

source: When using a pure HWND (as an Integer or an Object with a HWND property), as in WinShow(A_ScriptHwnd) or WinMoveTop(myGui), except with WinWait or WinWaitClose.
ja: WinShow(A_ScriptHwnd)やWinMoveTop(myGui)のように、WinWaitやWinWaitClose以外のpure HWND（ IntegerやHWNDプロパティを持つObject）を使用する場合。

source: When using a pure HWND, as in WinShow(A_ScriptHwnd).
ja: WinShow(A_ScriptHwnd)のように純粋なHWNDを使用する場合。

source: When using an object with a Hwnd property (such as a Gui), as in WinMoveTop(myGui).
ja: WinMoveTop(myGui)のように、Hwndプロパティを持つオブジェクト（Guiなど）を使用する場合です。

source: When using it this way, be aware of the need to declare the variable first if it is global.
ja: このような使い方をする場合、変数がグローバルな場合は最初に宣言する必要があることに注意してください。

source: When using the 64-bit version of AutoHotkey with a 64-bit window, the result is a 64-bit signed integer between -9223372036854775808 and 9223372036854775807.
ja: 64ビット版AutoHotkeyを64ビットウィンドウで使用する場合、結果は-9223372036854775808から9223372036854775807の間の64ビット符号付き整数となります。

source: When using the #Hotstring directive, use *0 to turn this option back off.
ja: #Hotstringディレクティブを使用するときは、このオプションをオフに戻すには*0を使用します。

source: When using the #Hotstring directive, C0 can be used to turn this option back off, which makes hotstrings conform again.
ja: Hotstringディレクティブを使用する場合、C0を使用してこのオプションをオフに戻すことができ、これによりホットストリングは再び適合するようになります。

source: When using the standard 32-bit calling convention, ParamCount must specify the size of the parameter list in DWORDs (the number of bytes divided by 4).
ja: 標準の32ビット呼び出し規約を使用する場合、ParamCountはパラメータリストのサイズをDWORD（バイト数を4で割った値）で指定する必要があります。

source: When using the traditional SendEvent method, reduce SetKeyDelay to 0 or -1, which should help because it sends the keystrokes more quickly.
ja: 従来のSendEventメソッドを使用する場合、SetKeyDelayを0または-1にすると、より早くキーストロークが送信されるため、効果があるはずです。

source: When using the {property:value} notation, quote marks must not be used for properties.
ja: {property:value}表記を使う場合、プロパティに引用符を使ってはならない。

source: When using this method, the text of the title (if any is desired) should be listed first, followed by one or more additional criteria.
ja: この方法を使用する場合、タイトルのテキスト（必要な場合）を最初に記載し、その後に1つ以上の追加基準を記載する。

source: When we speak of free software, we are referring to freedom, not price.
ja: 私たちがフリーソフトウェアについて語るとき、自由について言及しているのであって、価格について言及しているのではない。

source: When writing a REG_BINARY key, use a string of hex characters, e.g. the REG_BINARY value of 01,a9,ff,77 can be written by using the string 01A9FF77.
ja: REG_BINARYキーを書くときは、16進数の文字列を使用します。例えば、REG_BINARY値01,a9,ff,77は、01A9FF77という文字列で書くことができます。

source: When writing a REG_MULTI_SZ key, you must separate each component from the next with a linefeed character (`n).
ja: REG_MULTI_SZキーを書くときは、各コンポーネントと次のコンポーネントをラインフィード文字（`n）で区切る必要があります。

source: When writing your code, it is very important to NOT type the square brackets in your code.
ja: コードを書く際には、角括弧をコード中に入力しないことが非常に重要です。

source: When writing your code, it is very important to not type the square brackets in your code.
ja: コードを書く際には、角括弧をコード中に入力しないことが非常に重要です。

source: When you click the middle mouse button while certain types of windows are active, this script displays a menu of your favorite folders.
ja: ある種のウィンドウがアクティブな状態でマウスの中ボタンをクリックすると、このスクリプトはお気に入りのフォルダのメニューを表示する。

source: When you create an object, the object is created at some location you don't control, and you're given a reference.
ja: オブジェクトを作成するとき、オブジェクトはあなたがコントロールできない場所に作成され、リファレンスが与えられます。

source: When you log off, all apps running under your session are terminated, including AutoHotkey.
ja: ログオフすると、AutoHotkeyを含め、セッション下で動作しているすべてのアプリが終了します。

source: When you press Ctrl+Shift+", the following example sends two quote marks and then moves the insertion point to the left, ready to type inside the quote marks:
ja: Ctrl+Shift+"を押すと、次の例では2つの引用符が送られ、挿入点が左に移動して引用符の内側を入力できる状態になります：

source: When you press the hotkey, the program executes the first hotkey variant whose condition is met, or the one without a condition (such as the final #c:: in the example above).
ja: ホットキーを押すと、プログラムは条件が満たされた最初のホットキーバリアント、または条件のないもの（上の例では最後の#c::など）を実行します。

source: When you rent a unit, you're given a key which you can use to access the unit.
ja: ユニットを借りる際に、ユニットにアクセスするために使用するキーをお渡ししています。

source: When you return to the group via GroupActivate, GroupDeactivate, or GroupClose, the window you were most recently working with is activated rather than the oldest window.
ja: GroupActivate、GroupDeactivate、GroupCloseでグループに戻ると、最も古いウィンドウではなく、直近で操作していたウィンドウがアクティブになります。

source: When you run the script, it will prompt you to select the executable file of your editor.
ja: スクリプトを実行すると、お使いのエディタの実行ファイルを選択するよう促されます。

source: When you type an abbreviation, it must exactly match the case defined in the script.
ja: 略語を入力するときは、スクリプトで定義されている大文字と正確に一致する必要があります。

source: When you use a key as a prefix in a custom combination, AutoHotkey assumes that you don't want the normal function of the key to activate, since that would interfere with its use as a modifier key.
ja: カスタムコンビネーションでキーをプレフィックスとして使用する場合、AutoHotkeyは、修飾キーとしての使用の妨げになるため、キーの通常の機能を有効にしたくないと仮定しています。

source: When you want to move a window, it is often useful to move or size it relative to its previous position or size, which can be retrieved by using the WinGetPos function.
ja: ウィンドウを移動させる場合、WinGetPos関数で取得できる以前の位置やサイズからの相対移動が便利なことが多いです。

source: When you're ready to resume, un-pause the script via the File or Tray menu.
ja: 再開の準備ができたら、ファイルメニューまたはトレイメニューからスクリプトの一時停止を解除する。

source: Whenever Speed is greater than zero, SetMouseDelay also influences the speed by producing a delay after each incremental move the mouse makes toward its destination.
ja: Speedが0より大きい場合、SetMouseDelayは、マウスが目的地に向かう各増分移動の後に遅延を生成することによって、速度にも影響を与えます。

source: Whenever a GUI thread is launched, that thread's last found window starts off as the GUI window itself.
ja: GUIスレッドが起動すると、そのスレッドの最後に見つかったウィンドウがGUIウィンドウそのものとしてスタートします。

source: Whenever a function is called by a timer, it starts off fresh with the default values for settings such as SendMode.
ja: タイマーから関数が呼び出されると、SendModeなどの設定は常にデフォルト値で新しくスタートします。

source: Whenever a function is called via a menu item, it starts off fresh with the default values for settings such as SendMode.
ja: メニューから関数を呼び出すと、SendModeなどの設定値は常に初期値でスタートします。

source: Whenever a new process starts, it generally inherits the environment of the process which launched it (the parent process).
ja: 新しいプロセスが起動すると、一般的にそのプロセスを起動したプロセス（親プロセス）の環境を引き継ぎます。

source: Whenever a timer is created or updated with a new period, its function will not be called right away; its time period must expire first.
ja: タイマーを作成したり、新しい周期で更新したりすると、その関数はすぐに呼び出されることはありません。

source: Whenever an exit attempt is made, each OnExit function starts off fresh with the default values for settings such as SendMode.
ja: 終了を試みるたびに、各 OnExit 関数はSendModeなどの設定のデフォルト値で新たに開始されます。

source: Whenever an object is created by the default implementation of ClassName(), the new object's __New method is called in order to allow custom initialization.
ja: ClassName()のデフォルト実装によってオブジェクトが生成されるたびに、新しいオブジェクトの__Newメソッドが呼び出されます。

source: Whenever any new thread is launched (whether by a hotkey, hotstring, timer, or some other event), the following settings are copied from the auto-execute thread.
ja: 新しいスレッドが（ホットキー、ホットストリング、タイマー、その他のイベントによって）起動されるたびに、以下の設定が自動実行スレッドからコピーされます。

source: Whenever any thread is paused, timers will not run.
ja: どのスレッドも一時停止すると、タイマーは実行されません。

source: Whenever no matching windows exist, the function will not wait for Timeout to expire.
ja: マッチするウィンドウが存在しない場合、この関数はタイムアウトが切れるのを待たない。

source: Whenever the caller omits such a parameter, the function creates a local variable to contain the default value; in other words, the function behaves as though the symbol "&" is absent.
ja: 呼び出し側がこのようなパラメータを省略した場合、関数はローカル変数を作成し、デフォルト値を格納します。

source: Whenever the control has no date/time, Gui.Submit and GuiCtrl.Value will retrieve a blank value (empty string).
ja: コントロールに日付/時刻がない場合は常に、Gui.Submitと GuiCtrl.Valueは空白の値（空の文字列）を取得します。

source: Whenever the script is waiting for the clipboard to become available, new threads cannot be launched and timers will not run.
ja: クリップボードが使用可能になるのをスクリプトが待っている間は常に、新しいスレッドを起動できず、タイマーも実行されません。

source: Whenever you type "{" with the following hotstring active, it sends "}" and then Left to move the insertion point back between the braces:
ja: 以下のホットストリングがアクティブな状態で「{」を入力すると、「}」を送信し、さらにLeftで挿入点を中括弧の間に戻す：

source: Where x and y are integers and y is positive, the power operator now gives correct results for all inputs if in range, where previously some precision was lost due to the internal use of floating-point math.
ja: xと yが整数でyが正の場合、以前は内部で浮動小数点演算を使用していたため精度が落ちていましたが、範囲内であればすべての入力に対して正しい結果を与えるようになりました。

source: Where ErrorLevel was previously set to indicate an error condition, an exception is thrown instead, with a (usually) more helpful error message.
ja: ErrorLevelがエラー状態を示すために設定されていた場合、代わりに例外がスローされ、（通常）より有益なエラーメッセージが表示されます。

source: Where Fn is an object, Fn() (previously written as %Fn%()) now calls Fn.Call() instead of Fn.() (which can now only be written as Fn.%""%()).
ja: Fnがオブジェクトの場合、Fn()（以前は%Fn%()と表記）は、Fn.()（現在はFn.%""%()としてしか表記できない）の代わりにFn.Call()を呼ぶようになりました。

source: Where a literal string is followed by an ambiguous unary/binary operator, an error is reported at load-time.
ja: リテラル文字列の後に曖昧な単項/二項演算子が続く場合、ロード時にエラーが報告されます。

source: Where can I find the official build, or older releases?
ja: 公式ビルドや旧バージョンはどこで入手できますか？

source: Where they are defined within the hierarchy is not important.
ja: 階層構造の中でどこに定義されるかは重要ではありません。

source: Where to install.
ja: 設置場所。

source: Where two physical keys share the same VK but differ by SC (such as Up and NumpadUp), they are handled by SC.
ja: 2つの物理キーが同じVKを共有し、SCによって異なる場合（Upと NumpadUpなど）、SCによって扱われます。

source: Whether a key is considered text or non-text is determined when the key is pressed.
ja: キーが押されたときに、テキストとみなされるか非テキストとみなされるかは、キーが押されたときに判断されます。

source: Whether it's 1, or 3253 (or more).
ja: それが1人であろうと、3253人（あるいはそれ以上）であろうと。

source: Whether that is true depends on what the Program does.
ja: それが真実かどうかは、プログラムの内容次第だ。

source: Whether this works depends on a combination of factors:
ja: これがうまくいくかどうかは、さまざまな要因が重なって決まります：

source: Whether this works depends on a combination of factors: 1) Whether the hotkey to be overridden is a hook hotkey in the other script (non-hook hotkeys can always be overridden); 2) The fact that the most recently started script's hotkeys generally take precedence over those in other scripts (therefore, if the script intending to override was started most recently, its override should always succeed); 3) Whether the enabling or creating of this hotkey will newly activate the keyboard or mouse hook (if so, the override will always succeed).
ja: これがうまくいくかどうかは、さまざまな要因が重なって決まります：1) オーバーライドするホットキーが他のスクリプトのフックホットキーであるかどうか（フックでないホットキーは常にオーバーライド可能）、2) 最も最近起動したスクリプトのホットキーが他のスクリプトのそれよりも一般的に優先されるという事実（したがって、オーバーライドしようとするスクリプトが最も最近起動した場合、そのオーバーライドは常に成功します）、 3) このホットキーを有効または作成することによってキーボードまたはマウスフックを新たにアクティブ化するかどうか（その場合、オーバーライドは必ず成功します）。

source: Whether to install for all users or the current user.
ja: すべてのユーザーにインストールするか、現在のユーザーにインストールするか。

source: Whether to restore the state of CapsLock after a Send.
ja: Send関数を使用した後にCapsLockキーの状態を復元するかどうかを決定する関数です。

source: Which physical button this corresponds to depends on system settings; by default it is the left button.
ja: どの物理ボタンに対応するかはシステムの設定によりますが、デフォルトでは左ボタンになっています。

source: Which physical button this corresponds to depends on system settings; by default it is the right button.
ja: どの物理ボタンに対応するかはシステムの設定によりますが、デフォルトでは右ボタンになります。

source: Which value that is could change repeatedly during the time your script is running.
ja: どの値かは、スクリプトの実行中に繰り返し変更される可能性があります。

source: WhichFolder := DirSelect() ; Ask the user to pick a folder.
ja: WhichFolder := DirSelect() ; フォルダーを選んでもらいます。

source: While Beta is a simple name, Param is an ordinary variable or sub-expression, or a list of sub-expressions separated by commas (the same as in a function's parameter list).
ja: Betaが単純な名前であるのに対し、Paramは通常の変数や部分式、あるいはカンマで区切られた部分式のリスト（関数のパラメータリストと同じ）です。

source: While Ctrl is held down, NumLock produces the key code of Pause, so use ^Pause in hotkeys instead of ^NumLock.
ja: Ctrl が押されている間、NumLock は Pauseのキーコードを生成するため、ホットキーには^NumLockの代わりに^Pauseを使う。

source: While Ctrl is held down, ScrollLock produces the key code of CtrlBreak, but can be differentiated from Pause by scan code.
ja: Ctrlが押されている間、ScrollLock は CtrlBreakのキーコードを生成しますが、スキャンコードによってPauseと区別することができます。

source: While Ctrl is held down, Pause produces the key code of CtrlBreak and NumLock produces Pause, so use ^CtrlBreak in hotkeys instead of ^Pause.
ja: Ctrlを押している間は、Pauseは CtrlBreak、NumLockは Pauseのキーコードを生成するので、ホットキーでは^Pauseの代わりに^CtrlBreakを使用します。

source: While Loop - Syntax & Usage | AutoHotkey v2
ja: While Loop - 構文と使用法｜AutoHotkey v2

source: While RunWait is in a waiting state, new threads can be launched via hotkey, custom menu item, or timer.
ja: RunWaitが待機状態にある間、ホットキー、カスタムメニュー項目、またはタイマーを使って新しいスレッドを起動することができます。

source: While a catch statement is executing, throw can be used without parameters to re-throw the exception (avoiding the need to specify an output variable just for that purpose).
ja: catch文の実行中に、例外を再スローするためにパラメータなしでthrowを使用することができます（その目的のためだけに出力変数を指定する必要を避けることができます）。

source: While a property definition defines the get and set accessor functions for a property in the same way as DefineProp, a method definition defines the call accessor function.
ja: プロパティ定義では、DefinePropと同じようにプロパティのgetと setのアクセサ関数を定義しますが、メソッド定義では呼び出しのアクセサ関数を定義します。

source: While a script like this is running, the entire operating system and all applications are affected by timeBeginPeriod below.
ja: このようなスクリプトが実行されている間、オペレーティング・システム全体とすべてのアプリケーションは、以下のtimeBeginPeriodの影響を受ける。

source: While enumerating properties, methods or array elements, it is generally unsafe to insert or remove items of that type.
ja: プロパティ、メソッド、配列の要素を列挙している間、そのタイプの項目を挿入したり削除したりすることは一般的に安全ではありません。

source: While execution is within a Catch, Value can be omitted to re-throw the caught value (avoiding the need to specify an output variable just for that purpose).
ja: Catchの中で実行されている間は、Valueを省略することで、キャッチした値を再スローすることができる（そのためだけに出力変数を指定する必要はない）。

source: While most applications are limited to combinations of Ctrl, Alt, Shift and sometimes Win with one other key (and often not all keys on the keyboard are supported), AutoHotkey isn't so limited.
ja: ほとんどのアプリケーションは、Ctrl、Alt、Shift、場合によってはWinと他の1つのキーの組み合わせに限定されていますが（キーボードのすべてのキーに対応していないことも多い）、AutoHotkeyはそれほど限定されてはいません。

source: While running the following example, try focusing a non-empty text editor or input field and pressing 1 or 2 while holding Ctrl or Ctrl+Shift:
ja: 以下の例を実行しながら、空でないテキストエディターや入力フィールドにフォーカスし、CtrlまたはCtrl+Shiftを押したまま、1または2を押してみてください：

source: While sleeping, new threads can be launched via hotkey, custom menu item, or timer.
ja: スリープ中、新しいスレッドは ホットキー、カスタムメニュー、タイマーで起動できる。

source: While the ahk_pid criterion is limited to one specific process, the ahk_exe criterion considers all processes with name or full path matching a given string.
ja: ahk_pid 基準が特定のプロセスに限定されるのに対して、 ahk_exe 基準は、与えられた文字列と一致する名前またはフルパスを持つ すべてのプロセスを考慮する。

source: While the RunAs feature is in effect, Run and RunWait will not able to launch documents, URLs, or system verbs.
ja: RunAs機能が有効な間は、RunおよびRunWaitは、ドキュメント、URL、システム動詞を起動することができなくなります。

source: While the function is in a waiting state, new threads can be launched via hotkey, custom menu item, or timer.
ja: 関数が待機状態にある間、ホットキー、カスタムメニュー項目、またはタイマーによって新しいスレッドを起動することができます。

source: While the text to replace your typed text goes on the right of the second pair of colons.
ja: 入力したテキストを置き換えるテキストは、2つ目のコロンの右側に置く。

source: While the window is visible, the user can interact with it and raise events which are handled by the script.
ja: ウィンドウが表示されている間、ユーザーはウィンドウと対話し、スクリプトによって処理されるイベントを発生させることができます。
